_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_1 (Conv1D)            (None, 9000, 32)          256       
_________________________________________________________________
batch_normalization_1 (Batch (None, 9000, 32)          128       
_________________________________________________________________
activation_1 (Activation)    (None, 9000, 32)          0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 9000, 32)          7200      
_________________________________________________________________
batch_normalization_2 (Batch (None, 9000, 32)          128       
_________________________________________________________________
activation_2 (Activation)    (None, 9000, 32)          0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 9000, 32)          7200      
_________________________________________________________________
batch_normalization_3 (Batch (None, 9000, 32)          128       
_________________________________________________________________
activation_3 (Activation)    (None, 9000, 32)          0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 9000, 32)          7200      
_________________________________________________________________
batch_normalization_4 (Batch (None, 9000, 32)          128       
_________________________________________________________________
activation_4 (Activation)    (None, 9000, 32)          0         
_________________________________________________________________
conv1d_5 (Conv1D)            (None, 9000, 32)          7200      
_________________________________________________________________
batch_normalization_5 (Batch (None, 9000, 32)          128       
_________________________________________________________________
activation_5 (Activation)    (None, 9000, 32)          0         
_________________________________________________________________
conv1d_6 (Conv1D)            (None, 9000, 32)          7200      
_________________________________________________________________
batch_normalization_6 (Batch (None, 9000, 32)          128       
_________________________________________________________________
activation_6 (Activation)    (None, 9000, 32)          0         
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 4500, 32)          0         
_________________________________________________________________
conv1d_7 (Conv1D)            (None, 4500, 64)          14400     
_________________________________________________________________
batch_normalization_7 (Batch (None, 4500, 64)          256       
_________________________________________________________________
activation_7 (Activation)    (None, 4500, 64)          0         
_________________________________________________________________
conv1d_8 (Conv1D)            (None, 4500, 64)          28736     
_________________________________________________________________
batch_normalization_8 (Batch (None, 4500, 64)          256       
_________________________________________________________________
activation_8 (Activation)    (None, 4500, 64)          0         
_________________________________________________________________
conv1d_9 (Conv1D)            (None, 4500, 64)          28736     
_________________________________________________________________
batch_normalization_9 (Batch (None, 4500, 64)          256       
_________________________________________________________________
activation_9 (Activation)    (None, 4500, 64)          0         
_________________________________________________________________
conv1d_10 (Conv1D)           (None, 4500, 64)          28736     
_________________________________________________________________
batch_normalization_10 (Batc (None, 4500, 64)          256       
_________________________________________________________________
activation_10 (Activation)   (None, 4500, 64)          0         
_________________________________________________________________
conv1d_11 (Conv1D)           (None, 4500, 64)          28736     
_________________________________________________________________
batch_normalization_11 (Batc (None, 4500, 64)          256       
_________________________________________________________________
activation_11 (Activation)   (None, 4500, 64)          0         
_________________________________________________________________
conv1d_12 (Conv1D)           (None, 4500, 64)          28736     
_________________________________________________________________
batch_normalization_12 (Batc (None, 4500, 64)          256       
_________________________________________________________________
activation_12 (Activation)   (None, 4500, 64)          0         
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 2250, 64)          0         
_________________________________________________________________
conv1d_13 (Conv1D)           (None, 2250, 128)         24704     
_________________________________________________________________
batch_normalization_13 (Batc (None, 2250, 128)         512       
_________________________________________________________________
activation_13 (Activation)   (None, 2250, 128)         0         
_________________________________________________________________
conv1d_14 (Conv1D)           (None, 2250, 128)         49280     
_________________________________________________________________
batch_normalization_14 (Batc (None, 2250, 128)         512       
_________________________________________________________________
activation_14 (Activation)   (None, 2250, 128)         0         
_________________________________________________________________
conv1d_15 (Conv1D)           (None, 2250, 128)         49280     
_________________________________________________________________
batch_normalization_15 (Batc (None, 2250, 128)         512       
_________________________________________________________________
activation_15 (Activation)   (None, 2250, 128)         0         
_________________________________________________________________
conv1d_16 (Conv1D)           (None, 2250, 128)         49280     
_________________________________________________________________
batch_normalization_16 (Batc (None, 2250, 128)         512       
_________________________________________________________________
activation_16 (Activation)   (None, 2250, 128)         0         
_________________________________________________________________
conv1d_17 (Conv1D)           (None, 2250, 128)         49280     
_________________________________________________________________
batch_normalization_17 (Batc (None, 2250, 128)         512       
_________________________________________________________________
activation_17 (Activation)   (None, 2250, 128)         0         
_________________________________________________________________
conv1d_18 (Conv1D)           (None, 2250, 128)         49280     
_________________________________________________________________
batch_normalization_18 (Batc (None, 2250, 128)         512       
_________________________________________________________________
activation_18 (Activation)   (None, 2250, 128)         0         
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 1125, 128)         0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 1125, 128)         0         
_________________________________________________________________
conv1d_19 (Conv1D)           (None, 1125, 256)         98560     
_________________________________________________________________
batch_normalization_19 (Batc (None, 1125, 256)         1024      
_________________________________________________________________
activation_19 (Activation)   (None, 1125, 256)         0         
_________________________________________________________________
conv1d_20 (Conv1D)           (None, 1125, 256)         196864    
_________________________________________________________________
batch_normalization_20 (Batc (None, 1125, 256)         1024      
_________________________________________________________________
activation_20 (Activation)   (None, 1125, 256)         0         
_________________________________________________________________
conv1d_21 (Conv1D)           (None, 1125, 256)         196864    
_________________________________________________________________
batch_normalization_21 (Batc (None, 1125, 256)         1024      
_________________________________________________________________
activation_21 (Activation)   (None, 1125, 256)         0         
_________________________________________________________________
conv1d_22 (Conv1D)           (None, 1125, 256)         196864    
_________________________________________________________________
batch_normalization_22 (Batc (None, 1125, 256)         1024      
_________________________________________________________________
activation_22 (Activation)   (None, 1125, 256)         0         
_________________________________________________________________
conv1d_23 (Conv1D)           (None, 1125, 256)         196864    
_________________________________________________________________
batch_normalization_23 (Batc (None, 1125, 256)         1024      
_________________________________________________________________
activation_23 (Activation)   (None, 1125, 256)         0         
_________________________________________________________________
conv1d_24 (Conv1D)           (None, 1125, 256)         196864    
_________________________________________________________________
batch_normalization_24 (Batc (None, 1125, 256)         1024      
_________________________________________________________________
activation_24 (Activation)   (None, 1125, 256)         0         
_________________________________________________________________
max_pooling1d_4 (MaxPooling1 (None, 562, 256)          0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 562, 256)          0         
=================================================================
Total params: 1,559,840
Trainable params: 1,554,080
Non-trainable params: 5,760
_________________________________________________________________
None
